{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "bonus",
    "1": "deposit",
    "2": "withdraw",
    "3": "game_issue",
    "4": "login_account",
    "5": "anger_feedback",
    "6": "other"
  },
  "initializer_range": 0.02,
  "label2id": {
    "anger_feedback": 5,
    "bonus": 0,
    "deposit": 1,
    "game_issue": 3,
    "login_account": 4,
    "other": 6,
    "withdraw": 2
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "vocab_size": 30522
}
